{
	"name": "Inventory Utilities",
	"description": "[b]Heads up![/b] This mod is still in the early stages of development and might be riddled with bugs! I'm actively working on it, but mind the mess in the meantime!\n\nThis mod seeks to make your inventory management experience easier by introducing an array of new features to simplify crafting and inventory management. Gone are the days of having to sift through a bunch of chests just to find that one stray material you deposited in the wrong spot!\n\n[h1]Features[/h1]\n[h3]Crafting Panel Ingredient Pulling[/h3]\nA new button on the crafting panel will allow you to attempt to pull the required ingredients for any recipe into the current inventory so that you can craft it without having to go hunt down the materials. You can even specify a quantity for if you want to make more than one at a time!\n\n[h3]Construction Hammer Ingredient Pulling[/h3]\nPressing the Interact key (E by default) while building with the Construction Hammer will pull the ingredients you're missing for the currently-selected construction recipe. If you hold the Sprint key (Left Shift by default) while doing this you'll pull enough ingredients for five of the recipe instead.\n\n[h3]Quality of Life UI Updates[/h3]\nCrafting stations will now show up to nine crafting thralls to select from instead of the previous maximum of three. This helps when using other mods that combine the functions of several benches and support a larger selection of thralls. The crafting station inventory UI has been rearranged some to make this look nice, still.\n\n[h1]Future Development[/h1]\n[h3]Planned[/h3]\n[list]\n[*]Additional information about an item in the crafting UI (armor bonuses, weapon damage, etc.)\n[*]Ability to quickly stack items into multiple nearby inventories at once.\n[*]Construction hammer recipe filtering\n[/list]\n\n[h3]Additional Ideas (No Guarantees)[/h3]\n[list]\n[*]Ability to apply filters to placeable inventories to prevent certain items from being deposited on accident.\n[/list]\n\n[h1]Mod Comptability[/h1]\nThis mod updates the crafting panel UI component and therefore is likely not compatible with other mods that update that component. Please let me know if you run into anything you think is related to compatability!\n\n[h1]Community[/h1]\nJoin the Discord to follow along with updates for all my mods and make suggestions! https://discord.gg/QCHB5QVgCv\n\nWant to contribute? Feel free to open a pull request to the GitHub repository and I'll review it! https://github.com/mjdean94/InventoryUtilities",
	"changeNote": "[h3]Version 0.5.0[/h3]\n[list]\n[*] Shifted some things around on the Crafting Station Inventory UI to allow for up to nine thralls to display without it looking bad.\n[/list]",
	"author": "Technoplex",
	"authorUrl": "",
	"versionMajor": 0,
	"versionMinor": 5,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "3353816673",
	"steamTestLivePublishedFileId": "",
	"steamVisibility": 0,
	"folderName": "InventoryUtilities",
	"revisionNumber": 1043755,
	"snapshotId": 42715,
	"fileSize": -1056138007
}