{
	"name": "Inventory Utilities",
	"description": "[b]Heads up![/b] This mod is still in the early stages of development and might be riddled with bugs! I'm actively working on it, but mind the mess in the meantime!\n\nThis mod seeks to make your inventory management experience easier by introducing an array of new features to simplify crafting and inventory management. Gone are the days of having to sift through a bunch of chests just to find that one stray material you deposited in the wrong spot!\n\n[h1]Features[/h1]\n[h3]Crafting Panel Ingredient Pulling[/h3]\nA new button on the crafting panel will allow you to attempt to pull the required ingredients for any recipe into the current inventory so that you can craft it without having to go hunt down the materials. You can even specify a quantity for if you want to make more than one at a time!\n\n[h3]Construction Hammer Ingredient Pulling[/h3]\nPressing Z while building with the Construction Hammer will pull the ingredients you're missing for the currently-selected construction recipe.\n\n[h1]Future Development[/h1]\n[h3]Planned[/h3]\n[list]\n[*]Additional information about an item in the crafting UI (armor bonuses, weapon damage, etc.)\n[*]Custom keybinding\n[*]Ability to pull enough ingredients for multiple crafts with the Construction Hammer\n[/list]\n\n[h3]Additional Ideas (No Guarantees)[/h3]\n[list]\n[*]Ability to quick-stack items from an inventory into other nearby inventories. (Think emptying your bags or cleaning out a cluttered crafting station)\n[*]Ability to apply filters to placeable inventories to prevent certain items from being deposited on accident.\n[/list]\n\n[h1]Mod Comptability[/h1]\nThis mod updates the crafting panel UI component and therefore is likely not compatible with other mods that update that component. Please let me know if you run into anything you think is related to compatability!\n\n[h1]Community[/h1]\nJoin the Discord to follow along with updates for all my mods and make suggestions! https://discord.gg/QCHB5QVgCv\n\nWant to contribute? Feel free to open a pull request to the GitHub repository and I'll review it! https://github.com/mjdean94/InventoryUtilities",
	"changeNote": "[h3]Version 0.3.0 - Dynamic Keybinds[/h3]\n[list]\n[*] Changed the keybind for pulling ingredients with the construction hammer to be whatever Interact is bound to (E by default).\n[*] You can now pull enough ingredients for five of the selected construction recipe if you hold the Sprint key whil pressing the interact key (Shift)\n[/list]\n\nDeveloper Note: I contemplated building out a custom settings UI to set these keybinds so that they could be entirely separate from the vanilla keybinds, but I didn't like the resulting experience. I like where it landed, but I'm definitely interested in hearing if it's annoying or if there are certain edge cases where there's a issues with this setup. ",
	"author": "Technoplex",
	"authorUrl": "",
	"versionMajor": 0,
	"versionMinor": 3,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "3353816673",
	"steamTestLivePublishedFileId": "",
	"steamVisibility": 3,
	"folderName": "InventoryUtilities",
	"revisionNumber": 1043755,
	"snapshotId": 42715,
	"fileSize": -1056138007
}